-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Documents\GitHub\MTF_Mental-Health\output\MH_stat_output_decades.log
  log type:  text
 opened on:  28 Sep 2024, 12:00:53

. 
. fre gdwk gdsp gdpa

gdwk -- gdwk
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        254       0.51       0.51       0.51
        2 Not so good |        249       0.50       0.50       1.00
        3 Fairly good |       1901       3.79       3.79       4.79
        4 Good        |      14374      28.63      28.63      33.42
        5 Very good   |      33422      66.58      66.58     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

gdsp -- gdsp
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        581       1.16       1.16       1.16
        2 Not so good |        842       1.68       1.68       2.83
        3 Fairly good |       3942       7.85       7.85      10.69
        4 Good        |      16228      32.33      32.33      43.01
        5 Very good   |      28607      56.99      56.99     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

gdpa -- gdpa
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        901       1.79       1.79       1.79
        2 Not so good |       1330       2.65       2.65       4.44
        3 Fairly good |       4419       8.80       8.80      13.25
        4 Good        |      15854      31.58      31.58      44.83
        5 Very good   |      27696      55.17      55.17     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

. 
. global CVs i.sex i.race i.momed i.region

. 
. cap drop year_c

. cap drop year_sq

. 
. summ year

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        year |     50,200    1999.052    10.87753       1984       2022

. gen year_c = year - `r(mean)'

. gen year_sq = year_c^2 // same as year_c*year_c

. 
. 
. ******** WORKER (gdwk)
. 
. ologit   gdwk $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40946.605  
Iteration 2:  Log pseudolikelihood = -40946.533  
Iteration 3:  Log pseudolikelihood = -40946.533  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  =  68.11
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40946.533                       Pseudo R2     = 0.0012

------------------------------------------------------------------------------------
                   |               Robust
              gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.055764   .0232577     2.46   0.014     1.011149    1.102346
                   |
              race |
            Black  |   1.277956   .0453433     6.91   0.000     1.192105    1.369991
                   |
             momed |
Completed college  |     .99438   .0225176    -0.25   0.803     .9512113    1.039508
                   |
            region |
          Midwest  |    1.02391   .0303157     0.80   0.425     .9661836    1.085086
            South  |   1.059766   .0313604     1.96   0.050     1.000049    1.123049
             West  |   1.071612    .046997     1.58   0.115     .9833476    1.167799
-------------------+----------------------------------------------------------------
             /cut1 |   -5.22876   .0789814                     -5.383561   -5.073959
             /cut2 |  -4.548893   .0593001                     -4.665119   -4.432667
             /cut3 |  -2.892509   .0356427                     -2.962367    -2.82265
             /cut4 |  -.5946771   .0274771                     -.6485313   -.5408229
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs i.decade                                  [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40916.537  
Iteration 2:  Log pseudolikelihood = -40916.431  
Iteration 3:  Log pseudolikelihood = -40916.431  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(10) = 106.58
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40916.431                       Pseudo R2     = 0.0019

------------------------------------------------------------------------------------
                   |               Robust
              gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.055376   .0232526     2.45   0.014     1.010772    1.101948
                   |
              race |
            Black  |   1.270434   .0450929     6.74   0.000     1.185058    1.361961
                   |
             momed |
Completed college  |   .9754621    .022534    -1.08   0.282     .9322812    1.020643
                   |
            region |
          Midwest  |    1.02131   .0302492     0.71   0.477     .9637107    1.082352
            South  |   1.054846   .0312642     1.80   0.072     .9953149    1.117937
             West  |   1.134348   .0511549     2.80   0.005     1.038389    1.239174
                   |
            decade |
            1990s  |   1.047125   .0299737     1.61   0.108     .9899948    1.107551
            2000s  |   1.136356   .0362983     4.00   0.000     1.067394    1.209774
            2010s  |   1.218126   .0424031     5.67   0.000     1.137789    1.304135
            2020s  |   .9302888   .0780671    -0.86   0.389     .7892007      1.0966
-------------------+----------------------------------------------------------------
             /cut1 |  -5.160518   .0797167                      -5.31676   -5.004276
             /cut2 |  -4.480664   .0609093                     -4.600044   -4.361284
             /cut3 |  -2.824131   .0388539                     -2.900283   -2.747979
             /cut4 |  -.5247292   .0324348                     -.5883003   -.4611582
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs i.decade i.religion i.famstru             [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40868.705  
Iteration 2:  Log pseudolikelihood = -40868.513  
Iteration 3:  Log pseudolikelihood = -40868.513  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(16) = 177.31
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40868.513                       Pseudo R2     = 0.0031

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.045367   .0231161     2.01   0.045     1.001028     1.09167
                           |
                      race |
                    Black  |   1.257886   .0462702     6.24   0.000      1.17039    1.351923
                           |
                     momed |
        Completed college  |   .9572364   .0223362    -1.87   0.061     .9144442    1.002031
                           |
                    region |
                  Midwest  |   1.003802   .0299368     0.13   0.899     .9468092    1.064226
                    South  |   1.030067   .0309124     0.99   0.324     .9712273    1.092472
                     West  |   1.131001   .0512588     2.72   0.007     1.034868    1.236063
                           |
                    decade |
                    1990s  |   1.057964   .0303768     1.96   0.050     1.000071    1.119209
                    2000s  |   1.154277   .0370664     4.47   0.000     1.083867    1.229261
                    2010s  |   1.253043   .0439476     6.43   0.000     1.169802    1.342209
                    2020s  |   .9678348   .0810109    -0.39   0.696     .8213966     1.14038
                           |
                  religion |
                   Rarely  |   1.171322   .0405555     4.57   0.000     1.094472    1.253568
    Once or twice a month  |   1.153098   .0459242     3.58   0.000     1.066512    1.246714
About once a week or more  |   1.286382   .0456243     7.10   0.000     1.199998    1.378986
                           |
                   famstru |
              Mother Only  |   1.014011   .0304585     0.46   0.643     .9560366    1.075501
              Father Only  |   1.047685   .0616372     0.79   0.428     .9335833    1.175732
    Neither Mother/Father  |   .8334671   .0457994    -3.32   0.001      .748367    .9282444
---------------------------+----------------------------------------------------------------
                     /cut1 |  -5.021949    .084516                     -5.187598   -4.856301
                     /cut2 |  -4.341824   .0674507                     -4.474025   -4.209623
                     /cut3 |    -2.6842   .0474716                     -2.777242   -2.591157
                     /cut4 |  -.3826589    .042002                     -.4649813   -.3003366
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs i.decade i.religion i.famstru ///
>         c.happy_N_std c.lifesat_N_std c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -39893.415  
Iteration 2:  Log pseudolikelihood = -39885.295  
Iteration 3:  Log pseudolikelihood = -39885.294  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(19) = 1517.99
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -39885.294                      Pseudo R2     =  0.0271

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |     1.1332   .0257604     5.50   0.000     1.083819    1.184831
                           |
                      race |
                    Black  |   1.187858   .0450883     4.54   0.000     1.102694      1.2796
                           |
                     momed |
        Completed college  |   .9211167   .0219308    -3.45   0.001     .8791207    .9651189
                           |
                    region |
                  Midwest  |   1.017497   .0310827     0.57   0.570     .9583643    1.080279
                    South  |   1.020713   .0312627     0.67   0.503     .9612423    1.083864
                     West  |   1.097269   .0505396     2.02   0.044     1.002553    1.200934
                           |
                    decade |
                    1990s  |   1.038387   .0304331     1.29   0.199       .98042    1.099781
                    2000s  |   1.141056   .0375307     4.01   0.000     1.069818    1.217037
                    2010s  |   1.343963   .0484386     8.20   0.000       1.2523    1.442334
                    2020s  |   1.240652   .1056902     2.53   0.011     1.049873    1.466099
                           |
                  religion |
                   Rarely  |   1.113423   .0396532     3.02   0.003     1.038354    1.193918
    Once or twice a month  |   1.044006   .0425354     1.06   0.291     .9638794    1.130792
About once a week or more  |    1.13776   .0415962     3.53   0.000     1.059085    1.222279
                           |
                   famstru |
              Mother Only  |   1.049668   .0325264     1.56   0.118     .9878151    1.115395
              Father Only  |   1.082827   .0649018     1.33   0.184     .9628095    1.217805
    Neither Mother/Father  |   .9004674   .0507569    -1.86   0.063      .806284    1.005653
                           |
               happy_N_std |   1.045014   .0138583     3.32   0.001     1.018202    1.072532
             lifesat_N_std |   1.056163   .0138448     4.17   0.000     1.029373     1.08365
           selfconcept_std |   1.459362   .0188332    29.29   0.000     1.422912    1.496745
---------------------------+----------------------------------------------------------------
                     /cut1 |  -5.138212   .0846548                     -5.304133   -4.972292
                     /cut2 |  -4.455497   .0677275                     -4.588241   -4.322754
                     /cut3 |  -2.783927   .0482291                     -2.878454     -2.6894
                     /cut4 |  -.4278796   .0430484                     -.5122529   -.3435063
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. 
.         
. ******** SPOUSE (gdsp)
. ologit   gdsp $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -51304.602  
Iteration 2:  Log pseudolikelihood = -51304.581  
Iteration 3:  Log pseudolikelihood = -51304.581  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  = 110.93
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -51304.581                       Pseudo R2     = 0.0015

------------------------------------------------------------------------------------
                   |               Robust
              gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.183426   .0243534     8.18   0.000     1.136644    1.232133
                   |
              race |
            Black  |   1.130047   .0378403     3.65   0.000     1.058263    1.206701
                   |
             momed |
Completed college  |   .9955464   .0210354    -0.21   0.833     .9551597    1.037641
                   |
            region |
          Midwest  |   .9495342   .0262479    -1.87   0.061     .8994581    1.002398
            South  |   1.039476   .0289096     1.39   0.164     .9843307    1.097711
             West  |   .9110439   .0370953    -2.29   0.022     .8411638    .9867293
-------------------+----------------------------------------------------------------
             /cut1 |  -4.344218   .0549778                     -4.451973   -4.236464
             /cut2 |  -3.453505   .0395716                     -3.531064   -3.375946
             /cut3 |  -2.016103   .0286343                     -2.072225   -1.959981
             /cut4 |  -.1667515   .0256327                     -.2169906   -.1165124
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs i.decade                                  [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -51218.457  
Iteration 2:  Log pseudolikelihood = -51218.366  
Iteration 3:  Log pseudolikelihood = -51218.366  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(10) = 230.96
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -51218.366                       Pseudo R2     = 0.0032

------------------------------------------------------------------------------------
                   |               Robust
              gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.183726   .0243808     8.19   0.000     1.136892    1.232489
                   |
              race |
            Black  |   1.119846   .0375012     3.38   0.001     1.048706    1.195813
                   |
             momed |
Completed college  |   .9659519   .0208799    -1.60   0.109     .9258827    1.007755
                   |
            region |
          Midwest  |   .9451936   .0262114    -2.03   0.042     .8951914    .9979888
            South  |   1.032623    .028815     1.15   0.250     .9776631    1.090672
             West  |   1.007894   .0423046     0.19   0.851     .9282974    1.094315
                   |
            decade |
            1990s  |   1.113711   .0298234     4.02   0.000     1.056766    1.173725
            2000s  |   1.327099   .0396311     9.48   0.000     1.251653    1.407093
            2010s  |   1.318869   .0430138     8.49   0.000     1.237202    1.405927
            2020s  |   .9814938   .0783984    -0.23   0.815       .83926    1.147833
-------------------+----------------------------------------------------------------
             /cut1 |  -4.211992   .0561329                     -4.322011   -4.101974
             /cut2 |  -3.321246   .0419043                     -3.403377   -3.239115
             /cut3 |  -1.882566   .0327742                     -1.946802    -1.81833
             /cut4 |  -.0285995   .0304862                     -.0883514    .0311523
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs i.decade i.religion i.famstru             [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -50998.807  
Iteration 2:  Log pseudolikelihood = -50998.246  
Iteration 3:  Log pseudolikelihood = -50998.246  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(16) = 527.24
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -50998.246                       Pseudo R2     = 0.0075

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.157748   .0240148     7.06   0.000     1.111624    1.205786
                           |
                      race |
                    Black  |   1.111596   .0386595     3.04   0.002     1.038349    1.190009
                           |
                     momed |
        Completed college  |   .9276429   .0202757    -3.44   0.001     .8887424    .9682461
                           |
                    region |
                  Midwest  |   .9024108   .0253328    -3.66   0.000     .8541008    .9534535
                    South  |   .9687991   .0275269    -1.12   0.265     .9163221    1.024281
                     West  |   .9995479   .0422994    -0.01   0.991     .9199876    1.085989
                           |
                    decade |
                    1990s  |   1.137478    .030653     4.78   0.000     1.078958    1.199172
                    2000s  |   1.379945   .0416564    10.67   0.000     1.300668    1.464054
                    2010s  |   1.412658   .0467491    10.44   0.000      1.32394    1.507321
                    2020s  |   1.078751   .0857221     0.95   0.340     .9231686    1.260553
                           |
                  religion |
                   Rarely  |   1.344841   .0446504     8.92   0.000     1.260114    1.435264
    Once or twice a month  |   1.492795   .0564585    10.59   0.000      1.38614    1.607656
About once a week or more  |   1.712267    .058223    15.82   0.000     1.601872    1.830271
                           |
                   famstru |
              Mother Only  |   .9206482   .0257785    -2.95   0.003     .8714847    .9725852
              Father Only  |    .976994   .0546687    -0.42   0.677     .8755118    1.090239
    Neither Mother/Father  |   .8484162    .044868    -3.11   0.002     .7648807     .941075
---------------------------+----------------------------------------------------------------
                     /cut1 |  -3.941164   .0623947                     -4.063456   -3.818873
                     /cut2 |  -3.048729   .0498181                     -3.146371   -2.951088
                     /cut3 |  -1.604429   .0421214                     -1.686985   -1.521872
                     /cut4 |   .2601449   .0402969                      .1811645    .3391253
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs i.decade i.religion i.famstru ///
>         c.happy_N_std c.lifesat_N_std c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood =   -49606.2  
Iteration 2:  Log pseudolikelihood =   -49595.2  
Iteration 3:  Log pseudolikelihood = -49595.196  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(19) = 2264.78
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -49595.196                      Pseudo R2     =  0.0348

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.260241   .0269232    10.83   0.000     1.208562    1.314129
                           |
                      race |
                    Black  |   1.082758    .039195     2.20   0.028     1.008599     1.16237
                           |
                     momed |
        Completed college  |   .8841239   .0197704    -5.51   0.000     .8462115    .9237349
                           |
                    region |
                  Midwest  |    .909715   .0261395    -3.29   0.001     .8598984    .9624175
                    South  |   .9538594   .0277256    -1.63   0.104     .9010371    1.009778
                     West  |   .9661176    .041451    -0.80   0.422     .8881973    1.050874
                           |
                    decade |
                    1990s  |   1.118046   .0307031     4.06   0.000      1.05946    1.179872
                    2000s  |   1.354237   .0420046     9.78   0.000     1.274362    1.439118
                    2010s  |   1.489123   .0506341    11.71   0.000     1.393117    1.591746
                    2020s  |   1.422909   .1151482     4.36   0.000     1.214211    1.667478
                           |
                  religion |
                   Rarely  |   1.277098   .0432735     7.22   0.000     1.195039    1.364792
    Once or twice a month  |   1.344618   .0521092     7.64   0.000     1.246268    1.450729
About once a week or more  |   1.504463   .0523789    11.73   0.000     1.405226    1.610707
                           |
                   famstru |
              Mother Only  |   .9669012   .0277677    -1.17   0.241     .9139808    1.022886
              Father Only  |   1.028427   .0584423     0.49   0.622     .9200305    1.149594
    Neither Mother/Father  |   .9440277   .0509567    -1.07   0.286      .849256    1.049375
                           |
               happy_N_std |   1.167745   .0148064    12.23   0.000     1.139083    1.197128
             lifesat_N_std |   1.100312   .0137616     7.64   0.000     1.073667    1.127617
           selfconcept_std |   1.422464   .0177853    28.18   0.000     1.388029    1.457754
---------------------------+----------------------------------------------------------------
                     /cut1 |  -4.077935   .0625215                     -4.200475   -3.955395
                     /cut2 |  -3.175744   .0500855                      -3.27391   -3.077578
                     /cut3 |  -1.697828   .0427804                     -1.781676    -1.61398
                     /cut4 |    .242434   .0412239                      .1616367    .3232313
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

.         
. ******** PARENT (gdpa)
. ologit   gdpa $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54831.039  
Iteration 2:  Log pseudolikelihood = -54830.568  
Iteration 3:  Log pseudolikelihood = -54830.568  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  = 324.88
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54830.568                       Pseudo R2     = 0.0043

------------------------------------------------------------------------------------
                   |               Robust
              gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.175611   .0238938     7.96   0.000     1.129701    1.223388
                   |
              race |
            Black  |   1.579598   .0532331    13.57   0.000     1.478635    1.687456
                   |
             momed |
Completed college  |   .9654138   .0200617    -1.69   0.090     .9268836    1.005546
                   |
            region |
          Midwest  |   .8552576   .0234606    -5.70   0.000       .81049     .902498
            South  |    .948073   .0263527    -1.92   0.055     .8978044    1.001156
             West  |    .862928   .0345637    -3.68   0.000     .7977753    .9334016
-------------------+----------------------------------------------------------------
             /cut1 |  -3.953106   .0467232                     -4.044682    -3.86153
             /cut2 |  -3.020596   .0343503                     -3.087921    -2.95327
             /cut3 |  -1.815479    .027878                     -1.870119   -1.760839
             /cut4 |  -.1401054   .0255296                     -.1901425   -.0900682
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs i.decade                                  [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54777.472  
Iteration 2:  Log pseudolikelihood = -54776.913  
Iteration 3:  Log pseudolikelihood = -54776.913  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(10) = 399.36
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54776.913                       Pseudo R2     = 0.0053

------------------------------------------------------------------------------------
                   |               Robust
              gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.175532   .0238991     7.95   0.000     1.129612    1.223319
                   |
              race |
            Black  |   1.570202   .0528857    13.40   0.000     1.469895    1.677354
                   |
             momed |
Completed college  |    .944497   .0200712    -2.69   0.007      .905966    .9846666
                   |
            region |
          Midwest  |   .8515745   .0233939    -5.85   0.000     .8069358    .8986826
            South  |   .9423874    .026238    -2.13   0.033     .8923398     .995242
             West  |   .9304519   .0383162    -1.75   0.080     .8583043    1.008664
                   |
            decade |
            1990s  |   1.099071   .0286664     3.62   0.000     1.044298    1.156717
            2000s  |   1.260867   .0375005     7.79   0.000     1.189469    1.336552
            2010s  |   1.218773    .039528     6.10   0.000     1.143711    1.298762
            2020s  |   .9642019   .0756385    -0.46   0.642     .8267877    1.124455
-------------------+----------------------------------------------------------------
             /cut1 |  -3.847163   .0481474                      -3.94153   -3.752795
             /cut2 |  -2.914689   .0368912                     -2.986995   -2.842384
             /cut3 |  -1.709137   .0315738                     -1.771021   -1.647254
             /cut4 |  -.0309817   .0298988                     -.0895823     .027619
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs i.decade i.religion i.famstru             [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54684.862  
Iteration 2:  Log pseudolikelihood = -54684.091  
Iteration 3:  Log pseudolikelihood = -54684.091  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(16) = 519.29
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54684.091                       Pseudo R2     = 0.0070

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.156092   .0236495     7.09   0.000     1.110657    1.203386
                           |
                      race |
                    Black  |    1.52556   .0531174    12.13   0.000     1.424924    1.633303
                           |
                     momed |
        Completed college  |   .9263573   .0198774    -3.56   0.000     .8882063     .966147
                           |
                    region |
                  Midwest  |   .8290332   .0229876    -6.76   0.000     .7851808    .8753348
                    South  |   .9048387   .0255771    -3.54   0.000     .8560719    .9563835
                     West  |   .9258883   .0384123    -1.86   0.063     .8535811    1.004321
                           |
                    decade |
                    1990s  |    1.11349   .0291862     4.10   0.000     1.057731    1.172189
                    2000s  |   1.292023   .0386918     8.56   0.000     1.218371    1.370127
                    2010s  |   1.272812   .0416709     7.37   0.000     1.193704    1.357163
                    2020s  |   1.029022   .0808201     0.36   0.716     .8822071    1.200269
                           |
                  religion |
                   Rarely  |   1.310749    .043667     8.12   0.000     1.227898    1.399191
    Once or twice a month  |   1.375169   .0521812     8.40   0.000     1.276607    1.481342
About once a week or more  |   1.440589   .0486249    10.82   0.000      1.34837    1.539115
                           |
                   famstru |
              Mother Only  |   1.013466   .0287783     0.47   0.638     .9586023    1.071469
              Father Only  |   .9393905   .0506666    -1.16   0.246     .8451544    1.044134
    Neither Mother/Father  |    1.02669    .053006     0.51   0.610     .9278836    1.136018
---------------------------+----------------------------------------------------------------
                     /cut1 |  -3.607801   .0555926                      -3.71676   -3.498841
                     /cut2 |  -2.673765   .0459869                     -2.763898   -2.583633
                     /cut3 |  -1.465328   .0412237                     -1.546125   -1.384531
                     /cut4 |    .216436   .0398896                      .1382538    .2946183
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs i.decade i.religion i.famstru ///
>         c.happy_N_std c.lifesat_N_std c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -53480.928  
Iteration 2:  Log pseudolikelihood = -53472.257  
Iteration 3:  Log pseudolikelihood = -53472.255  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(19) = 1986.90
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -53472.255                      Pseudo R2     =  0.0290

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.249472   .0261681    10.63   0.000     1.199222    1.301828
                           |
                      race |
                    Black  |   1.509055   .0543121    11.43   0.000     1.406274     1.61935
                           |
                     momed |
        Completed college  |   .8873633   .0193669    -5.48   0.000     .8502054    .9261452
                           |
                    region |
                  Midwest  |   .8348928   .0235734    -6.39   0.000     .7899449    .8823982
                    South  |   .8880417   .0255359    -4.13   0.000     .8393765    .9395284
                     West  |   .8976131   .0374661    -2.59   0.010     .8271044    .9741326
                           |
                    decade |
                    1990s  |   1.095741   .0292647     3.42   0.001     1.039858    1.154626
                    2000s  |   1.268943   .0388934     7.77   0.000     1.194958    1.347509
                    2010s  |   1.330864   .0444605     8.56   0.000     1.246515    1.420921
                    2020s  |   1.306901   .1035482     3.38   0.001     1.118923    1.526458
                           |
                  religion |
                   Rarely  |   1.252576   .0423133     6.67   0.000      1.17233    1.338316
    Once or twice a month  |   1.250116   .0481792     5.79   0.000     1.159165    1.348203
About once a week or more  |   1.273974   .0436551     7.07   0.000     1.191222    1.362475
                           |
                   famstru |
              Mother Only  |   1.063304    .030888     2.11   0.035     1.004456      1.1256
              Father Only  |   .9898279   .0536065    -0.19   0.850     .8901451    1.100674
    Neither Mother/Father  |   1.139376   .0608592     2.44   0.015     1.026126    1.265126
                           |
               happy_N_std |   1.133544   .0140713    10.10   0.000     1.106297    1.161461
             lifesat_N_std |   1.093017    .013282     7.32   0.000     1.067292    1.119361
           selfconcept_std |   1.395868   .0175008    26.60   0.000     1.361985    1.430594
---------------------------+----------------------------------------------------------------
                     /cut1 |   -3.72246   .0557003                     -3.831631    -3.61329
                     /cut2 |  -2.776826   .0463191                      -2.86761   -2.686042
                     /cut3 |  -1.540988   .0418022                     -1.622919   -1.459057
                     /cut4 |   .2004051   .0406466                      .1207393    .2800709
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Documents\GitHub\MTF_Mental-Health\output\MH_stat_output_decades.log
  log type:  text
 closed on:  28 Sep 2024, 12:00:58
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
