-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Documents\GitHub\MTF_Mental-Health\output\MH_stat_output_only self-concept.log
  log type:  text
 opened on:  28 Sep 2024, 12:44:47

. 
. fre gdwk gdsp gdpa

gdwk -- gdwk
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        254       0.51       0.51       0.51
        2 Not so good |        249       0.50       0.50       1.00
        3 Fairly good |       1901       3.79       3.79       4.79
        4 Good        |      14374      28.63      28.63      33.42
        5 Very good   |      33422      66.58      66.58     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

gdsp -- gdsp
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        581       1.16       1.16       1.16
        2 Not so good |        842       1.68       1.68       2.83
        3 Fairly good |       3942       7.85       7.85      10.69
        4 Good        |      16228      32.33      32.33      43.01
        5 Very good   |      28607      56.99      56.99     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

gdpa -- gdpa
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1 Poor        |        901       1.79       1.79       1.79
        2 Not so good |       1330       2.65       2.65       4.44
        3 Fairly good |       4419       8.80       8.80      13.25
        4 Good        |      15854      31.58      31.58      44.83
        5 Very good   |      27696      55.17      55.17     100.00
        Total         |      50200     100.00     100.00           
-------------------------------------------------------------------

. 
. global CVs i.sex i.race i.momed i.region

. 
. cap drop year_c

. cap drop year_sq

. 
. summ year

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        year |     50,200    1999.052    10.87753       1984       2022

. gen year_c = year - `r(mean)'

. gen year_sq = year_c^2 // same as year_c*year_c

. 
. 
. ******** WORKER (gdwk)
. 
. ologit   gdwk $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40946.605  
Iteration 2:  Log pseudolikelihood = -40946.533  
Iteration 3:  Log pseudolikelihood = -40946.533  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  =  68.11
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40946.533                       Pseudo R2     = 0.0012

------------------------------------------------------------------------------------
                   |               Robust
              gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.055764   .0232577     2.46   0.014     1.011149    1.102346
                   |
              race |
            Black  |   1.277956   .0453433     6.91   0.000     1.192105    1.369991
                   |
             momed |
Completed college  |     .99438   .0225176    -0.25   0.803     .9512113    1.039508
                   |
            region |
          Midwest  |    1.02391   .0303157     0.80   0.425     .9661836    1.085086
            South  |   1.059766   .0313604     1.96   0.050     1.000049    1.123049
             West  |   1.071612    .046997     1.58   0.115     .9833476    1.167799
-------------------+----------------------------------------------------------------
             /cut1 |   -5.22876   .0789814                     -5.383561   -5.073959
             /cut2 |  -4.548893   .0593001                     -4.665119   -4.432667
             /cut3 |  -2.892509   .0356427                     -2.962367    -2.82265
             /cut4 |  -.5946771   .0274771                     -.6485313   -.5408229
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs year_c year_sq                            [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40924.059  
Iteration 2:  Log pseudolikelihood = -40923.967  
Iteration 3:  Log pseudolikelihood = -40923.967  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(8)  =  99.92
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40923.967                       Pseudo R2     = 0.0017

------------------------------------------------------------------------------------
                   |               Robust
              gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |     1.0553    .023245     2.44   0.015      1.01071    1.101857
                   |
              race |
            Black  |   1.272369   .0451447     6.79   0.000     1.186894    1.364001
                   |
             momed |
Completed college  |   .9742742   .0225477    -1.13   0.260     .9310688    1.019485
                   |
            region |
          Midwest  |    1.02177   .0302624     0.73   0.467     .9641452    1.082838
            South  |   1.054429   .0312279     1.79   0.074     .9949661    1.117446
             West  |   1.139958   .0515661     2.90   0.004     1.043241    1.245641
                   |
            year_c |   1.006491   .0011422     5.70   0.000     1.004254    1.008732
           year_sq |   .9996911   .0001087    -2.84   0.004     .9994781    .9999041
-------------------+----------------------------------------------------------------
             /cut1 |  -5.273922   .0797164                     -5.430163   -5.117681
             /cut2 |  -4.594126   .0606086                     -4.712917   -4.475335
             /cut3 |  -2.937849   .0376516                     -3.011645   -2.864054
             /cut4 |   -.638756   .0305173                     -.6985687   -.5789433
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs year_c year_sq i.religion i.famstru       [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -40875.567  
Iteration 2:  Log pseudolikelihood = -40875.396  
Iteration 3:  Log pseudolikelihood = -40875.396  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(14) = 171.70
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -40875.396                       Pseudo R2     = 0.0029

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.045152   .0231063     2.00   0.046     1.000832    1.091435
                           |
                      race |
                    Black  |   1.259069   .0462969     6.27   0.000     1.171522     1.35316
                           |
                     momed |
        Completed college  |   .9556357    .022349    -1.94   0.052     .9128211    1.000458
                           |
                    region |
                  Midwest  |   1.004015   .0299436     0.13   0.893     .9470084    1.064452
                    South  |   1.029195   .0308711     0.96   0.337     .9704326    1.091515
                     West  |   1.137815   .0517265     2.84   0.005     1.040818    1.243851
                           |
                    year_c |   1.007492   .0011544     6.51   0.000     1.005231    1.009757
                   year_sq |   .9996914   .0001087    -2.84   0.005     .9994783    .9999045
                           |
                  religion |
                   Rarely  |   1.171387   .0405549     4.57   0.000     1.094537    1.253632
    Once or twice a month  |   1.153363   .0459372     3.58   0.000     1.066752    1.247006
About once a week or more  |    1.28875   .0457383     7.15   0.000     1.202151    1.381587
                           |
                   famstru |
              Mother Only  |   1.015618   .0304916     0.52   0.606     .9575803    1.077174
              Father Only  |   1.048947   .0616806     0.81   0.416     .9347613    1.177081
    Neither Mother/Father  |   .8332266   .0457193    -3.33   0.001     .7482687    .9278306
---------------------------+----------------------------------------------------------------
                     /cut1 |  -5.147896   .0839946                     -5.312523    -4.98327
                     /cut2 |   -4.46783   .0665244                     -4.598216   -4.337445
                     /cut3 |  -2.810463   .0456228                     -2.899882   -2.721044
                     /cut4 |  -.5092044   .0396038                     -.5868265   -.4315823
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdwk $CVs year_c year_sq i.religion i.famstru ///
>         c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -40995.307  
Iteration 1:  Log pseudolikelihood = -39924.423  
Iteration 2:  Log pseudolikelihood = -39916.702  
Iteration 3:  Log pseudolikelihood = -39916.701  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(15) = 1486.81
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -39916.701                      Pseudo R2     =  0.0263

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdwk | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.135384   .0258005     5.59   0.000     1.085925    1.187095
                           |
                      race |
                    Black  |   1.161021   .0437631     3.96   0.000     1.078338    1.250043
                           |
                     momed |
        Completed college  |   .9203344   .0219258    -3.48   0.000     .8783485    .9643272
                           |
                    region |
                  Midwest  |   1.021427   .0311488     0.70   0.487     .9621647    1.084339
                    South  |   1.022901   .0312798     0.74   0.459     .9633943    1.086082
                     West  |   1.105434   .0510497     2.17   0.030     1.009773    1.210157
                           |
                    year_c |   1.010028   .0011808     8.54   0.000     1.007717    1.012345
                   year_sq |   1.000056   .0001107     0.51   0.610     .9998394    1.000273
                           |
                  religion |
                   Rarely  |   1.121845   .0398505     3.24   0.001     1.046396    1.202733
    Once or twice a month  |   1.056838   .0429615     1.36   0.174     .9759017    1.144486
About once a week or more  |    1.15767   .0422057     4.02   0.000     1.077835    1.243419
                           |
                   famstru |
              Mother Only  |   1.043866   .0322774     1.39   0.165     .9824825    1.109085
              Father Only  |   1.074259   .0642609     1.20   0.231     .9554126    1.207888
    Neither Mother/Father  |   .8918812   .0502281    -2.03   0.042     .7986746    .9959653
                           |
           selfconcept_std |   1.516372   .0174378    36.20   0.000     1.482577    1.550937
---------------------------+----------------------------------------------------------------
                     /cut1 |  -5.229709   .0840992                     -5.394541   -5.064878
                     /cut2 |  -4.547167   .0667926                     -4.678078   -4.416256
                     /cut3 |  -2.876556   .0462803                     -2.967264   -2.785848
                     /cut4 |  -.5222429   .0404989                     -.6016193   -.4428665
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. 
.         
. ******** SPOUSE (gdsp)
. ologit   gdsp $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -51304.602  
Iteration 2:  Log pseudolikelihood = -51304.581  
Iteration 3:  Log pseudolikelihood = -51304.581  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  = 110.93
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -51304.581                       Pseudo R2     = 0.0015

------------------------------------------------------------------------------------
                   |               Robust
              gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.183426   .0243534     8.18   0.000     1.136644    1.232133
                   |
              race |
            Black  |   1.130047   .0378403     3.65   0.000     1.058263    1.206701
                   |
             momed |
Completed college  |   .9955464   .0210354    -0.21   0.833     .9551597    1.037641
                   |
            region |
          Midwest  |   .9495342   .0262479    -1.87   0.061     .8994581    1.002398
            South  |   1.039476   .0289096     1.39   0.164     .9843307    1.097711
             West  |   .9110439   .0370953    -2.29   0.022     .8411638    .9867293
-------------------+----------------------------------------------------------------
             /cut1 |  -4.344218   .0549778                     -4.451973   -4.236464
             /cut2 |  -3.453505   .0395716                     -3.531064   -3.375946
             /cut3 |  -2.016103   .0286343                     -2.072225   -1.959981
             /cut4 |  -.1667515   .0256327                     -.2169906   -.1165124
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs year_c year_sq                            [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -51214.888  
Iteration 2:  Log pseudolikelihood = -51214.796  
Iteration 3:  Log pseudolikelihood = -51214.796  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(8)  = 241.61
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -51214.796                       Pseudo R2     = 0.0033

------------------------------------------------------------------------------------
                   |               Robust
              gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.183107   .0243634     8.17   0.000     1.136306    1.231835
                   |
              race |
            Black  |   1.122206   .0375872     3.44   0.001     1.050903    1.198348
                   |
             momed |
Completed college  |   .9631169   .0208427    -1.74   0.082     .9231203    1.004847
                   |
            region |
          Midwest  |   .9447038   .0261884    -2.05   0.040     .8947451     .997452
            South  |   1.030148   .0287259     1.07   0.287      .975357    1.088016
             West  |   1.015143   .0427618     0.36   0.721     .9346983    1.102512
                   |
            year_c |   1.011537   .0010782    10.76   0.000     1.009426    1.013652
           year_sq |   .9992618   .0001012    -7.29   0.000     .9990634    .9994602
-------------------+----------------------------------------------------------------
             /cut1 |  -4.449065   .0565976                     -4.559994   -4.338136
             /cut2 |  -3.558394   .0413043                     -3.639348   -3.477439
             /cut3 |  -2.119696   .0309569                     -2.180371   -2.059022
             /cut4 |   -.265348   .0284274                     -.3210647   -.2096313
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs year_c year_sq i.religion i.famstru       [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -50992.459  
Iteration 2:  Log pseudolikelihood = -50991.893  
Iteration 3:  Log pseudolikelihood = -50991.893  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(14) = 543.10
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -50991.893                       Pseudo R2     = 0.0076

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.156777   .0239941     7.02   0.000     1.110693    1.204774
                           |
                      race |
                    Black  |   1.113239   .0387273     3.08   0.002     1.039865    1.191791
                           |
                     momed |
        Completed college  |   .9238607   .0202234    -3.62   0.000     .8850618    .9643605
                           |
                    region |
                  Midwest  |   .9014381   .0253001    -3.70   0.000     .8531899    .9524147
                    South  |   .9655116   .0274277    -1.24   0.217     .9132234    1.020794
                     West  |     1.0091   .0428651     0.21   0.831     .9284886    1.096711
                           |
                    year_c |   1.014011   .0010978    12.85   0.000     1.011861    1.016165
                   year_sq |   .9992684   .0001015    -7.21   0.000     .9990696    .9994673
                           |
                  religion |
                   Rarely  |   1.345322   .0446946     8.93   0.000     1.260513    1.435837
    Once or twice a month  |   1.493873   .0565356    10.61   0.000     1.387075    1.608894
About once a week or more  |   1.719093   .0585486    15.91   0.000     1.608086    1.837763
                           |
                   famstru |
              Mother Only  |   .9220506   .0258282    -2.90   0.004     .8727929    .9740883
              Father Only  |   .9768513   .0546696    -0.42   0.676     .8753684    1.090099
    Neither Mother/Father  |   .8472657   .0447228    -3.14   0.002     .7639925    .9396155
---------------------------+----------------------------------------------------------------
                     /cut1 |  -4.207621   .0620607                     -4.329258   -4.085985
                     /cut2 |  -3.315266   .0484153                     -3.410158   -3.220374
                     /cut3 |  -1.870915   .0396695                     -1.948666   -1.793164
                     /cut4 |  -.0058484   .0376561                      -.079653    .0679562
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdsp $CVs year_c year_sq i.religion i.famstru ///
>         c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -51382.824  
Iteration 1:  Log pseudolikelihood = -49802.585  
Iteration 2:  Log pseudolikelihood = -49793.794  
Iteration 3:  Log pseudolikelihood = -49793.792  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(15) = 2065.17
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -49793.792                      Pseudo R2     =  0.0309

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdsp | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.263513   .0268943    10.99   0.000     1.211885     1.31734
                           |
                      race |
                    Black  |    1.01192   .0362566     0.33   0.741     .9432963    1.085536
                           |
                     momed |
        Completed college  |   .8860999   .0197501    -5.43   0.000     .8482238    .9256673
                           |
                    region |
                  Midwest  |   .9190731    .026301    -2.95   0.003     .8689431    .9720952
                    South  |   .9593545    .027752    -1.43   0.151     .9064748    1.015319
                     West  |   .9798556   .0420493    -0.47   0.635     .9008112    1.065836
                           |
                    year_c |   1.016841   .0011213    15.15   0.000     1.014645    1.019041
                   year_sq |   .9996385   .0001031    -3.50   0.000     .9994364    .9998406
                           |
                  religion |
                   Rarely  |   1.296616   .0436994     7.71   0.000     1.213735    1.385158
    Once or twice a month  |   1.381442     .05327     8.38   0.000     1.280883    1.489896
About once a week or more  |   1.563715   .0542331    12.89   0.000     1.460952    1.673706
                           |
                   famstru |
              Mother Only  |   .9504177   .0270922    -1.78   0.074     .8987741    1.005029
              Father Only  |   1.003847   .0568392     0.07   0.946     .8984034    1.121666
    Neither Mother/Father  |   .9197895    .049473    -1.55   0.120     .8277603     1.02205
                           |
           selfconcept_std |   1.559092   .0176965    39.13   0.000      1.52479    1.594165
---------------------------+----------------------------------------------------------------
                     /cut1 |   -4.29235    .062093                      -4.41405    -4.17065
                     /cut2 |  -3.391648    .048494                     -3.486694   -3.296601
                     /cut3 |  -1.918921    .040061                     -1.997439   -1.840403
                     /cut4 |   .0108875   .0382934                     -.0641662    .0859411
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

.         
. ******** PARENT (gdpa)
. ologit   gdpa $CVs                                           [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54831.039  
Iteration 2:  Log pseudolikelihood = -54830.568  
Iteration 3:  Log pseudolikelihood = -54830.568  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(6)  = 324.88
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54830.568                       Pseudo R2     = 0.0043

------------------------------------------------------------------------------------
                   |               Robust
              gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.175611   .0238938     7.96   0.000     1.129701    1.223388
                   |
              race |
            Black  |   1.579598   .0532331    13.57   0.000     1.478635    1.687456
                   |
             momed |
Completed college  |   .9654138   .0200617    -1.69   0.090     .9268836    1.005546
                   |
            region |
          Midwest  |   .8552576   .0234606    -5.70   0.000       .81049     .902498
            South  |    .948073   .0263527    -1.92   0.055     .8978044    1.001156
             West  |    .862928   .0345637    -3.68   0.000     .7977753    .9334016
-------------------+----------------------------------------------------------------
             /cut1 |  -3.953106   .0467232                     -4.044682    -3.86153
             /cut2 |  -3.020596   .0343503                     -3.087921    -2.95327
             /cut3 |  -1.815479    .027878                     -1.870119   -1.760839
             /cut4 |  -.1401054   .0255296                     -.1901425   -.0900682
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs year_c year_sq                            [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54766.112  
Iteration 2:  Log pseudolikelihood = -54765.537  
Iteration 3:  Log pseudolikelihood = -54765.537  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(8)  = 422.53
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54765.537                       Pseudo R2     = 0.0055

------------------------------------------------------------------------------------
                   |               Robust
              gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               sex |
            Women  |   1.175108   .0238904     7.94   0.000     1.129205    1.222878
                   |
              race |
            Black  |   1.572609   .0529965    13.43   0.000     1.472094    1.679987
                   |
             momed |
Completed college  |   .9425785   .0200605    -2.78   0.005     .9040693    .9827279
                   |
            region |
          Midwest  |   .8506892   .0233719    -5.89   0.000     .8060927    .8977531
            South  |    .940006   .0261591    -2.22   0.026     .8901083    .9927008
             West  |   .9373715   .0387455    -1.56   0.118     .8644264    1.016472
                   |
            year_c |   1.009014   .0010647     8.50   0.000     1.006929    1.011103
           year_sq |   .9992752   .0001007    -7.19   0.000     .9990779    .9994726
-------------------+----------------------------------------------------------------
             /cut1 |  -4.052089   .0480057                     -4.146178   -3.957999
             /cut2 |  -3.119611   .0365643                     -3.191275   -3.047946
             /cut3 |  -1.913838    .030549                     -1.973713   -1.853963
             /cut4 |  -.2350386   .0284102                     -.2907215   -.1793556
------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs year_c year_sq i.religion i.famstru       [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -54672.311  
Iteration 2:  Log pseudolikelihood = -54671.514  
Iteration 3:  Log pseudolikelihood = -54671.514  

Ordered logistic regression                             Number of obs = 50,200
                                                        Wald chi2(14) = 543.40
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -54671.514                       Pseudo R2     = 0.0072

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.155401   .0236358     7.06   0.000     1.109992    1.202667
                           |
                      race |
                    Black  |   1.527238   .0532037    12.16   0.000     1.426441    1.635157
                           |
                     momed |
        Completed college  |   .9237904   .0198552    -3.69   0.000     .8856832    .9635372
                           |
                    region |
                  Midwest  |   .8278281   .0229581    -6.81   0.000     .7840321    .8740705
                    South  |    .901915   .0254902    -3.65   0.000     .8533137    .9532846
                     West  |   .9339327   .0388873    -1.64   0.101     .8607421    1.013347
                           |
                    year_c |   1.010567   .0010778     9.86   0.000     1.008457    1.012682
                   year_sq |   .9992853   .0001009    -7.08   0.000     .9990876    .9994831
                           |
                  religion |
                   Rarely  |   1.310623   .0436425     8.12   0.000     1.227816    1.399013
    Once or twice a month  |   1.375712   .0521888     8.41   0.000     1.277134    1.481899
About once a week or more  |   1.445019   .0487615    10.91   0.000      1.35254    1.543821
                           |
                   famstru |
              Mother Only  |   1.014584   .0288272     0.51   0.610     .9596277    1.072687
              Father Only  |   .9394229   .0506701    -1.16   0.247     .8451806    1.044174
    Neither Mother/Father  |   1.024927   .0528681     0.48   0.633     .9263737    1.133966
---------------------------+----------------------------------------------------------------
                     /cut1 |  -3.830662   .0547179                     -3.937907   -3.723417
                     /cut2 |  -2.896613   .0448435                     -2.984504   -2.808721
                     /cut3 |   -1.68792   .0394972                     -1.765333   -1.610507
                     /cut4 |  -.0054475   .0378251                     -.0795834    .0686884
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. ologit   gdpa $CVs year_c year_sq i.religion i.famstru ///
>         c.selfconcept_std          [pweight = svyweight], or

Iteration 0:  Log pseudolikelihood = -55070.002  
Iteration 1:  Log pseudolikelihood = -53623.829  
Iteration 2:  Log pseudolikelihood = -53616.504  
Iteration 3:  Log pseudolikelihood = -53616.502  

Ordered logistic regression                            Number of obs =  50,200
                                                       Wald chi2(15) = 1822.32
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -53616.502                      Pseudo R2     =  0.0264

--------------------------------------------------------------------------------------------
                           |               Robust
                      gdpa | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                       sex |
                    Women  |   1.253431   .0262037    10.80   0.000     1.203111    1.305856
                           |
                      race |
                    Black  |   1.425191   .0508418     9.93   0.000     1.328947    1.528406
                           |
                     momed |
        Completed college  |   .8889471   .0193934    -5.40   0.000      .851738    .9277818
                           |
                    region |
                  Midwest  |   .8409948   .0236908    -6.15   0.000     .7958203    .8887337
                    South  |   .8929133   .0255853    -3.95   0.000     .8441492    .9444943
                     West  |   .9084368   .0380319    -2.29   0.022     .8368719    .9861216
                           |
                    year_c |   1.012991   .0010994    11.89   0.000     1.010838    1.015148
                   year_sq |   .9996107    .000102    -3.82   0.000     .9994108    .9998106
                           |
                  religion |
                   Rarely  |   1.268507    .042712     7.06   0.000     1.187496    1.355045
    Once or twice a month  |   1.279393   .0491987     6.41   0.000     1.186509    1.379547
About once a week or more  |    1.31768   .0450352     8.07   0.000     1.232305    1.408971
                           |
                   famstru |
              Mother Only  |   1.046001   .0302768     1.55   0.120     .9883116    1.107058
              Father Only  |   .9688983   .0522651    -0.59   0.558     .8716899    1.076947
    Neither Mother/Father  |   1.110057    .058881     1.97   0.049     1.000449    1.231674
                           |
           selfconcept_std |   1.510096   .0171722    36.25   0.000     1.476812    1.544131
---------------------------+----------------------------------------------------------------
                     /cut1 |  -3.901318   .0546869                     -4.008503   -3.794134
                     /cut2 |  -2.957123   .0449852                     -3.045293   -2.868954
                     /cut3 |  -1.724589   .0398614                     -1.802716   -1.646462
                     /cut4 |   .0097372   .0383398                     -.0654074    .0848818
--------------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Documents\GitHub\MTF_Mental-Health\output\MH_stat_output_only self-concept.log
  log type:  text
 closed on:  28 Sep 2024, 12:44:51
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
